const CONFIG = {
    SEASON: {
        COOLING_START: { month: 7, day: 1 },
        COOLING_END: { month: 9, day: 20 }
    },
    TOLERANCE: 40 / 60, 

    RULES_NORMAL: {
        "type1": { s: 17, ue: 1, le: 0.5 },
        "type2": { s: 15, ue: 1, le: 0.5 },
        "type3": { s: 15.5, ue: 1, le: 0.5 },
        "default": { s: 16.5, ue: 1, le: 0.5 }
    },
    RULES_COOLING: {
        "type1": { s: 12, ue: 0.5, le: 0.5 },
        "type2": { s: 9, ue: 0.5, le: 0.5 },
        "default": { s: 9, ue: 0.5, le: 0.5 }
    },

    // [공기청정기 기준]
    AIR_PURIFIER_STD: 17,      
    AIR_PURIFIER_LIMIT: 14,    

    L1_STATIONS_PURIFIER: [
        "대곡", "진천", "월배", "상인", "월촌", "송현", "서부정류장", "대명", "안지랑", "현충로", 
        "영대병원", "교대", "명덕", "반월당", "중앙로", "대구역", "칠성시장", "신천", "동대구역", "동구청", 
        "아양교", "동촌", "해안", "방촌", "용계", "율하", "신기", "반야월", "각산", "안심"
    ],

    STATION_MAP: {
        "명덕": "type1", "청라언덕": "type1", "반월당": "type1",
        "현충로": "type2", "중앙로": "type2", "안심": "type2", "다사": "type2", "두류": "type2", "담티": "type2", "영남대": "type2",
        "반월당(1호선)": "type3"
    },

    LINE2_STATIONS: ["문양", "다사", "대실", "강창", "계명대", "성서산업단지", "이곡", "용산", "죽전", "감삼", "두류", "내당", "반고개", "청라언덕", "반월당", "경대병원", "대구은행", "범어", "수성구청", "만촌", "담티", "연호", "대공원", "고산", "신매", "사월", "정평", "임당", "영남대"]
};
