const CONFIG = {
    SEASON: { COOLING_START: { month: 7, day: 1 }, COOLING_END: { month: 9, day: 20 } },
    VENT_SEASON: { INTER: [3, 4, 5, 10], SUMMER: [6, 7, 8, 9], WINTER: [11, 12, 1, 2] },
    
    // [공조기 기준치]
    NORMAL_TARGETS: { "type1": 17, "type2": 15, "type3": 15.5, "type4": 16.5 },
    COOLING_TARGETS: { "type1": 12, "type2": 9, "type3": 9 },
    
    AIR_PURIFIER_STD: 17, 
    TOLERANCE: 40 / 60,

    // [매핑] 2호선 역 명칭 일보와 시스템명 일치화
    L2_NAME_MAP: { "수성알파시티": "수성알파", "영남대": "영대", "성서산업단지": "성서산단" },

    // [예외] 장비가 아예 없어 '-'로 표기할 역사 및 항목
    NO_EQUIPMENT: {
        "다사": ["시하", "종하", "시점하부", "종점하부", "하부배기"],
        "대실": ["시하", "종하", "시점하부", "종점하부", "하부배기"]
    },

    BRANCHES: {
        line1: {
            left: { name: "송현기계분소", stations: ["설화명곡", "화원", "대곡", "진천", "월배", "상인", "월촌", "송현", "서부정류장", "대명", "안지랑", "현충로", "영대병원", "교대", "명덕", "반월당", "중앙로"] },
            right: { name: "동대구기계분소", stations: ["대구역", "칠성시장", "신천", "동대구역", "동구청", "아양교", "동촌", "해안", "방촌", "용계", "율하", "신기", "반야월", "각산", "안심"] }
        },
        line2: {
            left: { name: "문양기지기계분소", stations: ["문양", "다사", "대실", "강창", "계명대", "성서산업단지", "이곡", "용산", "죽전", "감삼", "두류", "내당", "반고개", "청라언덕"] },
            right: { name: "사월기계분소", stations: ["반월당", "경대병원", "대구은행", "범어", "수성구청", "만촌", "담티", "연호", "대공원", "고산", "신매", "사월", "정평", "임당", "영남대"] }
        }
    },
    STATION_MAP_NORMAL: { "명덕": "type1", "청라언덕": "type1", "반월당": "type1", "현충로": "type2", "중앙로": "type2", "안심": "type2", "다사": "type2", "두류": "type2", "담티": "type2", "영남대": "type2", "반월당(1호선)": "type3" },
    STATION_MAP_COOLING: { "화원": "type1", "반야월": "type1", "각산": "type1", "대곡": "type2", "월촌": "type2", "송현": "type2", "교대": "type2", "명덕": "type2", "동구청": "type2", "방촌": "type2", "용계": "type2", "율하": "type2", "신기": "type2" },
    LINE2_STATIONS: ["문양", "다사", "대실", "강창", "계명대", "성서산업단지", "이곡", "용산", "죽전", "감삼", "두류", "내당", "반고개", "청라언덕", "반월당", "경대병원", "대구은행", "범어", "수성구청", "만촌", "담티", "연호", "대공원", "고산", "신매", "사월", "정평", "임당", "영남대"],
    L1_STATIONS_PURIFIER: ["대곡", "진천", "월배", "상인", "월촌", "송현", "서부정류장", "대명", "안지랑", "현충로", "영대병원", "교대", "명덕", "반월당", "중앙로", "대구역", "칠성시장", "신천", "동대구역", "동구청", "아양교", "동촌", "해안", "방촌", "용계", "율하", "신기", "반야월", "각산", "안심"]
};
